FourPhaseSimulation/DNSCase01/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2512                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    arch        "LSB;label=32;scalar=64";
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    inlet
    {
        type            patch;
        nFaces          625;
        startFace       90625;
    }
    outlet
    {
        type            patch;
        nFaces          625;
        startFace       91250;
    }
    particleInlet
    {
        type            patch;
        nFaces          625;
        startFace       91875;
    }
    walls
    {
        type            wall;
        inGroups        1(wall);
        nFaces          5000;
        startFace       92500;
    }
)

// ************************************************************************* //
