FourPhaseSimulation/DNSCase01/system/setFieldsDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}

defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    volScalarFieldValue alpha.oil   0
    volScalarFieldValue alpha.air   0
    volScalarFieldValue alpha       0
);

regions
(
    // Oil droplet centred at (0.025, 0.05, 0.025), radius 0.008 m
    sphereToCell
    {
        centre  (0.025 0.05 0.025);
        radius  0.008;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil   1
            volScalarFieldValue alpha.air   0
            volScalarFieldValue alpha       1
        );
    }
);
